Config/InformationRegisters/УчетныеДанныеОбъектаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетныеДанныеОбъектаОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КФО</Name>
					<Comment>Только для счетов 101,102,103,108</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПС</Name>
					<Comment>Только для счетов 101,102,103,108.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаНФА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СведенияКадастровогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияКадастровогоУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КадастроваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощадиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощадиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомерЗемлиНедвижимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомерЗдания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодземныйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПомещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПримененияНовойСтоимостиКРасчетуНалога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/CommonModules/ЗаполнениеОтчетностиСерверПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ДополнитьСписокДоступныхТиповДанных(МассивДополнительныхТипов) Экспорт 
	

	МассивДополнительныхТипов.Добавить(Тип("СправочникСсылка.РазделыЛицевыхСчетов"));
	//МассивДополнительныхТипов.Добавить(Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет"));

	
	МассивДополнительныхТипов.Добавить(Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет"));
КонецПроцедуры

Функция МаксимальноеКоличествоСубконто() Экспорт 
	
	Возврат 3;
	
КонецФункции

Функция ПолучитьВидыТаблиц(СоответствиеРезультат) Экспорт 

	
КонецФункции

Процедура ОпределитьДокументыЗакрытияГода(МассивДокументовЗакрытие) Экспорт
	

	МассивДокументовЗакрытие.Добавить(Тип("ДокументСсылка.ЗакрытиеГода"));
	МассивДокументовЗакрытие.Добавить(Тип("ДокументСсылка.ЗакрытиеГодаТехнологическое"));
	МассивДокументовЗакрытие.Добавить(Тип("ДокументСсылка.ЗакрытиеЗабалансовыхСчетовПоступленийИВыбытийДенежныхСредств"));
	МассивДокументовЗакрытие.Добавить(Тип("ДокументСсылка.ЗакрытиеСчетовСанкционирования"));


КонецПроцедуры

Функция ПолучитьРеквизитДоговора(Знач ДоговорСсылка, Знач РеквизитДоговора, Знач ЗначениеНеопределено = Неопределено, Период = Неопределено) Экспорт
	
	РеквизитДоговораПоиск = РеквизитДоговора;


	Если ТипЗнч(ДоговорСсылка) <> Тип("СправочникСсылка.Договоры") ИЛИ НЕ ЗначениеЗаполнено(РеквизитДоговора) ИЛИ НЕ ЗначениеЗаполнено(ДоговорСсылка) Тогда
		Возврат ЗначениеНеопределено;
	КонецЕсли;
	
	Если ТипЗнч(РеквизитДоговора) = Тип("Строка") Тогда
		РеквизитДоговораПоиск = НРег(СокрЛП(РеквизитДоговораПоиск));
	КонецЕсли;
	

	
	Возврат ЗаполнениеОтчетностиПовтИсп.ПолучитьРеквизитДоговора(ДоговорСсылка,РеквизитДоговораПоиск,ЗначениеНеопределено,Период);
		
КонецФункции

Функция ПолучитьПолноеИмяВидыСубконто() Экспорт 
	


	Возврат "";
		

	
КонецФункции	

Процедура ПолучитьРазрешенныеВызовыОбщихМодулей(МассивВызовов) Экспорт 
	
	
КонецПроцедуры

функция ПолучитьЗначениеРеквизитаОС(ОсновноеСредство, Реквизит, Дата) Экспорт 
	
	Результат = Новый Структура("Переопределено,Значение");
	Результат.Вставить("Переопределено",Ложь);
	Результат.Вставить("Значение");
	
	ИмяРеквизита = ВРег(Реквизит);
		
	Если ИмяРеквизита = ВРег("СчетУчета") 
		ИЛИ ИмяРеквизита = ВРег("ВидУчета") 
		ИЛИ ИмяРеквизита = ВРег("ВидИмущества")  Тогда 
		
		Результат.Переопределено = Истина;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("ОсновноеСредство",ОсновноеСредство);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета,
		|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета КАК ВидУчета,
		|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества КАК ВидИмущества
		|ИЗ
		|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
		|			&Дата,
		|				ОсновноеСредство = &ОсновноеСредство) КАК УчетныеДанныеОбъектаОССрезПоследних";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Результат;
		КонецЕсли;
		
		Результат.Значение = РезультатЗапроса.Выгрузить()[0][ИмяРеквизита]; 
		
	ИначеЕсли ИмяРеквизита = ВРег("КадастровыйНомер") 
		ИЛИ ИмяРеквизита = ВРег("КадастровыйНомерЗемли")
		ИЛИ ИмяРеквизита = ВРег("КадастровыйНомерЗдания")
		ИЛИ ИмяРеквизита = ВРег("КадастроваяСтоимость") Тогда
		
		Результат.Переопределено = Истина;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("ОсновноеСредство",ОсновноеСредство);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
		|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемли,
		|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
		|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость
		|ИЗ                          
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(&Дата, ОсновноеСредство = &ОсновноеСредство) КАК СведенияКадастровогоУчетаСрезПоследних";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Результат;
		КонецЕсли;
		
		Результат.Значение = РезультатЗапроса.Выгрузить()[0][ИмяРеквизита]; 
		
	ИначеЕсли ИмяРеквизита = ВРег("Адрес") Тогда
		
		Результат.Переопределено = Истина;
		Результат.Значение = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ОсновноеСредство,Справочники.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС);	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	


	
Функция ПолучитьЗначениеДополнительногоРеквизитаСправочника(Ссылка,ИмяДопРеквизита,ТипОбъекта = Неопределено) Экспорт
	ИскомоеЗначение = "";
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ИскомоеЗначение;
	КонецЕсли;
	
	Если ТипОбъекта = Неопределено Тогда
		ТипОбъекта = "Справочник";
	КонецЕсли;
	
	Имя = Ссылка.Метаданные().Имя;
	Свойство = Неопределено;
	Попытка
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения[ИмяДопРеквизита];
	Исключение
		Свойство = Неопределено;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	СпрДополнительныеРеквизиты.Значение КАК ИскомоеЗначение
		|ИЗ
		|	"+ТипОбъекта+"."+Имя+".ДополнительныеРеквизиты КАК СпрДополнительныеРеквизиты
		|ГДЕ
		|	СпрДополнительныеРеквизиты.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ПоНаименованию
		|				ТОГДА СпрДополнительныеРеквизиты.Свойство.Наименование = &Наименование
		|			ИНАЧЕ СпрДополнительныеРеквизиты.Свойство = &Свойство
		|		КОНЕЦ";
	Запрос.УстановитьПараметр("ПоНаименованию", НЕ ЗначениеЗаполнено(Свойство));
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Наименование", ИмяДопРеквизита);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ИскомоеЗначение = Выборка.ИскомоеЗначение;
		КонецЕсли;
	Исключение
		ИскомоеЗначение = "";
	КонецПопытки;
	
	Возврат ИскомоеЗначение;
КонецФункции

Функция ПолучитьЗначениеДополнительныхСведений(Ссылка,ИмяДопСведений) Экспорт
	ИскомоеЗначение = "";
	
	Имя = Ссылка.Метаданные().Имя;
	Свойство = Неопределено;
	Попытка
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения[ИмяДопСведений];
	Исключение
		Свойство = Неопределено;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ДополнительныеСведения.Значение КАК ИскомоеЗначение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ПоНаименованию
		|				ТОГДА ДополнительныеСведения.Свойство.Наименование = &Наименование
		|			ИНАЧЕ ДополнительныеСведения.Свойство = &Свойство
		|		КОНЕЦ";
	Запрос.УстановитьПараметр("ПоНаименованию", НЕ ЗначениеЗаполнено(Свойство));
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Наименование", ИмяДопСведений);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ИскомоеЗначение = Выборка.ИскомоеЗначение;
		КонецЕсли;
	Исключение
		ИскомоеЗначение = "";
	КонецПопытки;
	
	Возврат ИскомоеЗначение;
КонецФункции
